zidian = {"小明": "15619516514",
          "小黄": "17661598709"}
print(zidian)

zidian["小明"]
print(zidian)

slang_dict = {"显眼包": "“显眼包”，原义是一个人过于张扬、爱出风头，甚至到了令人尴尬的地步。",
              "特种兵旅游": "“特种兵旅游”，也作“特种兵式旅游”，指高强度的旅行方式，即在周末或节假日等有限的时间里，游览尽可能多的景点。",
              "遥遥领先": "“遥遥领先”，本义是远远地走在最前面。余承东多次使用“遥遥领先”来形容华为手机在各项技术上与竞争对手的差距。",
              "你人还的":"“你人还怪好的（嘞）”，最早出自某视频博主。在视频中他模拟大学生心思单纯，，还不忘加上“您人还怪好的嘞”的称赞。"}
liuxingyu = input("请输入想要查询的流行语")
if liuxingyu in slang_dict:
    print(slang_dict[liuxingyu])
else:
    print("不在字典里")